app/views/manager/index.html.erb

SELECT "products".* FROM "products" WHERE "products"."id" = 1 LIMIT 1
SELECT "subscription_items".* FROM "subscription_items" WHERE "subscription_items"."subscription_id" = 48 LIMIT 1
SELECT "subscriptions".* FROM "subscriptions" WHERE (status = 'Active') ORDER BY created_at DESC
---
		<% if @subscriptions.empty? %>
			<p>There are no subscriptions yet :(</p>
		<% else %>
		<table width="99%">
			<thead>
				<tr>
					<th>Item</th>
					<th>Price</th>
					<th>Start Date</th>
					<th>Status</th>
					<th>Ordered</th>
				</tr>
			</thead>
			<tbody>
				<% @subscriptions.each do |sub| %>
				<tr>
					<td><%= link_to sub.subscription_items.first.product.name, manager_subscription_details_path(id: sub.id) %></td>
					<td><%= number_to_currency(sub.subscription_items.first.price) %></td>
					<td><%= sub.first_delivery.strftime('%d/%m/%Y')  %></td>
					<td><%= sub.status %></td>
					<td><%= sub.created_at.strftime('%d/%m/%Y') %></td>
				</tr>