app/views/manager/pack_sheets.html.erb

SELECT "subscription_items".* FROM "subscription_items" WHERE "subscription_items"."subscription_id" = 48 LIMIT 1
SELECT "subscriptions".* FROM "subscriptions" WHERE (status = 'Active') ORDER BY created_at DESC
---

		<p><%= sub.subscription_items.first.recipient1 %> -