app/views/manager/subscription_details.html.erb

SELECT "subscription_items".* FROM "subscription_items" WHERE "subscription_items"."subscription_id" = 48 LIMIT 1
---
					<tr>
						<td><%= @subscription.subscription_items.first.recipient1 %></td>