app/views/contact_mailer/subscription_success.html.erb


<%= @sub.subscription_items.each do |subs| %>
---
SELECT "subscription_items".* FROM "subscription_items" WHERE "subscription_items"."subscription_id" = 2