app/controllers/account_controller.rb

  def index
    @subscriptions = Subscription.where("user_id = ? AND status = ?", current_user, "Active").order("created_at DESC")
---
SELECT "subscriptions".* FROM "subscriptions" WHERE (user_id = 1 AND status = 'Active') ORDER BY created_at DESC

  def subscription
   # @subscription = Subscription.where("id = ? AND user_id = ? AND status = ?", params[:subscription_id], current_user, "Active")
    begin
   		@subscription = Subscription.find(params[:subscription_id])
---
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."id" = ? LIMIT 1  [["id", "1"]]