app/controllers/articles_controller.rb

  def index
    @featured = Article.where("published = ?", true).last
---
SELECT "articles".* FROM "articles" WHERE (published = 't') ORDER BY "articles"."id" DESC LIMIT 1