app/controllers/gocardless_controller.rb

	def confirm_subscription
		begin
      GoCardless.confirm_resource params
      #Rails.logger.info("GOCARDLESS: #{params.inspect}")
      sub = Subscription.find(params[:state])
      sub.update_attributes(:status => "Active", :resource_id => params[:resource_id])
---
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "subscriptions" SET "status" = 'Active', "resource_id" = '06CFTVWQEM', "updated_at" = '2012-09-29 15:51:21.307350' WHERE "subscriptions"."id" = 1

	def confirm_cancel_subscription
		sub = Subscription.find(params[:subscription_id])
		subscription = GoCardless.client.subscription(sub.resource_id)
		if subscription.status == "cancelled"
			sub.update_attributes(:status => "Cancelled")
---
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."id" = ? LIMIT 1  [["id", "6"]]
UPDATE "subscriptions" SET "status" = 'Cancelled', "updated_at" = '2012-09-30 00:20:59.544462' WHERE "subscriptions"."id" = 6