app/controllers/join_controller.rb

  def index
    @products = Product.where("is_subscription = ?", true).order("sub_price ASC")
---
SELECT "products".* FROM "products" WHERE (is_subscription = 't') ORDER BY sub_price ASC