app/controllers/manager_controller.rb

  def index
  	@subscriptions = Subscription.where("status = ?", "Active").order("created_at DESC")
    @cancelled = Subscription.where("status = ?", "Cancelled").order("created_at DESC")
    @comments = Comment.where("status = ?", "pending").count
---
SELECT "subscriptions".* FROM "subscriptions" WHERE (status = 'Active') ORDER BY created_at DESC
SELECT COUNT(*) FROM "comments" WHERE (status = 'pending')

  def subscription_details
  	@subscription = Subscription.find(params[:id])
---
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."id" = ? LIMIT 1  [["id", "47"]]

  def pack_sheets
  	@subscriptions = Subscription.where("status = ?", "Active").order("created_at DESC")
---
SELECT "subscriptions".* FROM "subscriptions" WHERE (status = 'Active') ORDER BY created_at DESC