app/controllers/subscriptions_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "promo_codes".* FROM "promo_codes" WHERE "promo_codes"."code" = '15PCOFF' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."email" = 'neal_howarth@tiscali.co.uk' LIMIT 1
---
  def new
    @product = Product.find(params[:product_id])
    @subscription = Subscription.new
    @subscription.subscription_items.build

    if !params[:code].empty?
      promo = PromoCode.find_by_code(params[:code])
      if promo
        if promo.expiry_date > Date.today
          if promo.product_id && promo.product_id == @product.id
            @promo = promo
          else
            flash[:error] = "Sorry, that Promo Code is not for this item"
          end
        else
          flash[:error] = "Sorry, that Promo Code has expired"
        end
      else
        flash[:error] = "Sorry that Promo Code is invalid"
      end
    end

    if !current_user
		  # see if email exists if not logged in
      @user = User.find_by_email(params[:email])

INSERT INTO "users" ("created_at", "email", "password_digest", "updated_at") VALUES (?, ?, ?, ?)
---
          redirect_to join_path and return
        else
          @user = User.new(:email => params[:email], :password => params[:password])
          if @user.save

INSERT INTO "subscription_items" ("age1", "age2", "created_at", "gender1", "gender2", "price", "product_id", "quantity", "recipient1", "recipient2", "subscription_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "subscriptions" ("county", "created_at", "first_delivery", "gift_message", "postcode", "resource_id", "status", "street", "town", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "promo_codes".* FROM "promo_codes" WHERE "promo_codes"."id" = ? LIMIT 1  [["id", "2"]]
---
  def create
    @subscription = Subscription.new(params[:subscription])
    start_date = get_start_date
  	@subscription.user_id = current_user.id
  	@subscription.first_delivery = start_date
  	# set the gift status to pending
  	@subscription.status = "Pending"
  	item = @subscription.subscription_items.first

    if @subscription.save
      # Promo Code
      promo = PromoCode.find(params[:subscription][:promo_code]) if params[:subscription][:promo_code]

INSERT INTO "promo_uses" ("created_at", "promo_code_id", "subscription_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 09 Oct 2012 11:01:12 UTC +00:00], ["promo_code_id", 1], ["subscription_id", 31], ["updated_at", Tue, 09 Oct 2012 11:01:12 UTC +00:00], ["user_id", 1]]
---
      # Add Promo Uses
      if promo
        promo_usage = PromoUse.new(promo_code_id: promo.id, user_id: current_user.id, subscription_id: @subscription.id)
        promo_usage.save

SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."resource_id" = '06CR8N0022' LIMIT 1
---
  def cancel_subscription
  	@subscription = Subscription.find_by_resource_id(params[:resource_id])