app/views/account/index.html.erb

SELECT "products".* FROM "products" WHERE "products"."id" = 1 LIMIT 1
SELECT "subscription_items".* FROM "subscription_items" WHERE "subscription_items"."subscription_id" = 1 LIMIT 1
SELECT "subscriptions".* FROM "subscriptions" WHERE (user_id = 1 AND status = 'Active') ORDER BY created_at DESC
SELECT COUNT(*) FROM "subscriptions" WHERE (user_id = 1 AND status = 'Active')
---
		<% if @subscriptions.empty? && @cancelled.empty? %>
			<p>You have not purchased any subscriptions yet :( Would you like to look at our <%= link_to "subscriptions", join_path %>?</p>
		<% else %>
		<table width="99%">
			<thead>
				<tr>
					<th>Item</th>
					<th>Price</th>
					<th>Start Date</th>
					<th>Status</th>
					<th>View</th>
				</tr>
			</thead>
			<tbody>
				<% @subscriptions.each do |sub| %>
				<tr>
					<td><%= sub.subscription_items.first.product.name %></td>
					<td><%= number_to_currency(sub.subscription_items.first.price) %></td>
					<td><%= sub.first_delivery.strftime('%d/%m/%Y')  %></td>
					<td><%= sub.status %>
					<td><%= link_to "View", action: :subscription, subscription_id: sub.id %></td>
				</tr>