app/views/account/subscription.html.erb


				<% @subscription.subscription_items.each do |subs| %>
---
SELECT "subscription_items".* FROM "subscription_items" WHERE "subscription_items"."subscription_id" = 1

				<h5>Schedule</h5>
				<p>Your subscription is for <%= number_to_currency(@subscription.subscription_items.first.price) %> every <%= pluralize(@subscription.subscription_items.first.product.sub_frequency, @subscription.subscription_items.first.product.sub_period) %></p>
---
SELECT "products".* FROM "products" WHERE "products"."id" = 1 LIMIT 1